In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2 = pd.DataFrame({'key':['a', 'b', 'd'], 'data2':range(3)})

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
df3 = pd.merge(df1, df2)

In [8]:
df3

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [ ]:
注意，我并没有指明要用哪个列进行连接。假设没有指定，merge 就会将重叠列的列名当做键

In [9]:
df4 = pd.merge(df1, df2, on='key')

In [10]:
df4

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [11]:
df5 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [12]:
df6 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [13]:
df5

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [14]:
df6

   data2 rkey
0      0    a
1      1    b
2      2    d

In [16]:
df7 = pd.merge(df5, df6, left_on='lkey', right_on='rkey')

In [17]:
df7

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [18]:
df8 = pd.merge(df5, df6, left_on='lkey', right_on='rkey',how='outer')

In [19]:
df8

   data1 lkey  data2 rkey
0    0.0    b    1.0    b
1    1.0    b    1.0    b
2    6.0    b    1.0    b
3    2.0    a    0.0    a
4    4.0    a    0.0    a
5    5.0    a    0.0    a
6    3.0    c    NaN  NaN
7    NaN  NaN    2.0    d

In [20]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'], 'lval': [1, 2, 3]})

In [21]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'], 'rval': [4, 5, 6, 7]})

In [22]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [23]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [24]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0